English_Questions/app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
def current_user
  if @current_user ||= User.find_by(id:session[:user_id])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
def logout
session.delete(:user_id)